# GetFilteredSolutionsPartsTypeCounts Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartBrowserChangedEventArgs..::..GetFilteredSolutionsPartsTypeCounts Method
FabricationPartBrowserChangedEventArgs Class See Also
---
Returns the active fabrication part type usage count in fitlered routing solutions.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IDictionary<ElementId, int> GetFilteredSolutionsPartsTypeCounts()
```

Visual Basic
---
```text
Public Function GetFilteredSolutionsPartsTypeCounts As IDictionary(Of ElementId, Integer)
```

Visual C++
---
```text
public:
IDictionary<ElementId^, int>^ GetFilteredSolutionsPartsTypeCounts()
```

# See Also
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace